public class NumsToWordsLATER {

    public static void main(String[] args) {

        //нормально прошариться за функции и массивы, за null,

        // 12. Введите сумму с клавиатуры. Необходимо вывести словами введенную сумму и в конце дописать название валюты с правильным окончанием.
        // здесь нужна проверка на разрядность числа!! Я юзану встроенные механизмы.
        // int num = 12345;
        // int digitCount = (int) (Math.log10(num) + 1);
        // System.out.println("Разрядность числа " + num + " равна " + digitCount);
        // 1 - один
        // 2 - два
        // 3 - три
        // 4 - четыре
        // 5 - пять
        // 6 - шесть
        // 7 - семь
        // 8 - восемь
        // 9 - девять
        // 10 - десять
        // 11 - одиннадцать
        // 12 - двенадцать
        // 13 - тринадцать
        // 14 - четырнадцать
        // 15 - пятнадцать
        // 16 - шестнадцать
        // 17 - семнадцать
        // 18 - восемнадцать
        // 19 - девятнадцать
        // 20 - двадцать
        // 30 - тридцать
        // 40 - сорок
        // 50 - пятьдесят
        // 60 - шестьдесят
        // 70 - семьдесят
        // 80 - восемьдесят
        // 90 - девяноста
        // 100 - сто
        // 200 - двести
        // 300 - триста
        // 400 - четыреста
        // 500 - пятьсот
        // 600 - шестьсот
        // 700 - семьсот
        // 800 - восемьсот
        // 900 - девятьсот
        // 1000 - одна тысяча (21000, 31000, 51000 тысяча)
        // 2000 - две тысячи (3 и 4)
        // 5000 - пять тысяч

        System.out.println("Введите желаемую сумму в белорусских рублях: ");

    }
}
